{
    "sections": [
        {
            "title": "Board of Directors",
            "members": [
                {
                    "name": "Y.A.M. TUNKU NAQUIYUDDIN\nIBNI TUANKU JA'FAR",
                    "title": "CHAIRMAN",
                    "image": "assets/images/team/tunku.png",
                    "credentials": "DK, DKYR, SPNS, SPMP, PPT\nOrdre National de la Legion d'Honneur (France)\nGran Cruz de la Orden Bernardo O'Higgins (Chile)\nBSc Econs. (Hons)\nTunku Laxamana Negeri Sembilan",
                    "history": [
                        "Y.A.M. TUNKU NAQUIYUDDIN is one of the most influential and prominent businessmen in Malaysia. Following his career as a diplomat in France, he assumed the role of Chairman of Antah Holdings Berhad. He was appointed Regent of Negri Sembilan from 1994 to 1999.",
                        "Y.A.M. Tunku is the Chairman of several publicly traded companies, including Sino Hua-An International Berhad (the first Malaysian cross-border China company listed on the Malaysian Stock Exchange) which was listed on the Malaysian Stock Exchange on 26th March 2007.",
                        "Y.A.M. Tunku also serves on the Boards of several publicly traded companies, including Techna X Bhd, Ann Joo Resources Berhad and Orix Leasing Malaysia Berhad. He founded and chaired the Federation of Public Listed Companies in 1986. In 1989, he was nominated to serve as a Committee Member of the KLSE till 1994.",
                        "As a keen environmentalist, Y.A.M. Tunku served on the World Wide Fund for Nature's Malaysian Committee, and the Business Council for Sustainable Development's Geneva Committee, where he co-wrote a book titled \"Changing Course\", which was presented at the Earth Summit in Rio in 1992. He has been the Pro-Chancellor of Universiti Kebangsaan Malaysia (UKM) since January 1, 2004.",
                        "In recognition of his environmental work, Y.A.M. Tunku was named a Royal Fellow of the LESTARI Institute at Universiti Kebangsaan Malaysia in November 2007. Y.A.M. TUNKU was elected a Fellow of Aberystwyth University in July 2008.",
                        "His current passion is to research into Green Energy and how hydrogen can benefit the world in its challenging pursuit to achieve a Net Zero carbon position."
                    ]
                },
                {
                    "name": "DR MAX CHEN",
                    "title": "FOUNDER | CHIEF EXECUTIVE OFFICER | CHIEF TECHNOLOGY OFFICER",
                    "image": "assets/images/team/dr_max.png",
                    "credentials": "PhD (Software Engineering)\nMicrosoft Certified Developer",
                    "history": [
                        "Max Chen is a preeminent leader in the software architecture and development industry, with a distinguished career spanning over 30 years. His professional trajectory exemplifies a synergistic combination of deep technical acumen and extensive global influence, underscored by pioneering achievements across multiple continents.",
                        "His portfolio features high-impact, transformative projects in Malaysia, Indonesia, China, the Philippines, and Vietnam, highlighting Dr. Max's exceptional ability to lead complex, large-scale projects and deliver innovative solutions across diverse markets. Driven by a forward-thinking approach, he has consistently set new benchmarks in digital infrastructure and technological advancement, solidifying his position as a trailblazer in the industry.",
                        "Dr. Max began his career as a software engineer, before advancing to chief software architect, chief technology officer and software project director roles. He has spearheaded significant IT infrastructure projects for both the Malaysian government and multinational corporations. Notable projects under his leadership include:",
                        "Malaysia City Bus Fleet Tracking System (RapidKL) – More than 3000 buses.\nMalaysian Highway Authority Control Centre Solutions (LLM).\nHighway Management Solutions – Implemented across more than 10 highways in Malaysia and 1 longest highway in Indonesia.\nMalaysia North-South Highway Integration System (PLUS).\nMalaysia Airport Indoor Wayfinding and Digital Signage System (KLIA2).\nWarehouse Management System – Unilever in Malaysia, China, Philippines & Vietnam.\nMalaysia Port Conventional Cargo Systems (Westport Malaysia).\nBusiness Intelligence, Accounting & Inventory Management System, e-Commerce Platform – For global small medium enterprises (SMEs), small medium industries (SMIs), companies and banks.\nHuman Resource and Payroll Management Systems – For banks, hotels, SMEs, SMIs, and companies.\nBlockchain Projects.",
                        "Following his corporate tenure, Dr. Max founded several IT ventures, namely AverNew Technology (a software research and development company), AverMax Capital Sdn Bhd. (a mortgage management solutions company), AverSave PLT (a digital directory and e-commerce platform), Averland PLT (a digital directory for property listings) and AVIC Biotech Global Bhd. (a stem cell company in partnership with a China GLC).",
                        "As the CEO of ProppyApp, Dr. Max is at the forefront of technological innovation and strategic growth, commanding a formidable presence within the tech industry. Renowned for his visionary outlook, he is dedicated to catalysing ProppyApp's development and expanding its global footprint. His approach involves equipping his team with the necessary tools and knowledge to excel while fostering an environment that drives innovation and agility. This strategic leadership ensures that ProppyApp can effectively navigate and lead in the evolving tech landscape.",
                        "At present, Dr Max Chen is focused on building a disruptive, cutting-edge ecosystem to revolutionise global industries undergoing Digital Transformation (DX). Drawing on his extensive experience, he envisions the strategic integration of Big Data, AI, Data Analytics, IoT, Blockchain, and Sharing Economy to drive global technological advancements. His goal is to leverage these technologies to foster innovation, enhance quality of life, and contribute to a more connected and equitable global community, addressing international challenges and promoting sustainable development."
                    ]
                },
                {
                    "name": "LEE WILLSON",
                    "title": "FOUNDER | CHIEF ARCHITECT, PROPPYAPP SDN. BHD.",
                    "image": "assets/images/team/wilson.png",
                    "credentials": "President, World Blockchain Foundation\nCo-Founder of Gartner Listed Blockchain Zoo\nBrandLaureate Award for Technology 2017 & 2019\nCCTV China Most Influential in 2018",
                    "history": [
                        "Mr Lee Willson is a globally recognised business consultant and technology architect renowned for his unparalleled achievements in establishing award-winning start-ups across the technology sector.",
                        "Throughout his illustrious career, he has driven noteworthy evolutionary advancements across various industries, from telecommunications and infrastructure to cutting-edge technologies like AI, IoT, PropTech and blockchain. Willson's journey has been nothing short of extraordinary, filled with groundbreaking milestones that have shaped the landscape of modern technology.",
                        "Willson's first gained international prominence in 2004 when he was invited as one of the only three entrepreneurs out of an entourage of over 50 to a direct dialogue with the State leadership in the People's Hall of Beijing. His fluent bilingual visionary message on this eminent stage left a strong impression and was widely reported in the local news.",
                        "In 2014, Willson released a captivating travel documentary \"Bitcoin World Tour,\" a seminal work that garnered global recognition on YouTube. Showcasing his profound knowledge, the documentary solidified his reputation as a respected figure in the industry, ultimately earning him the title of the \"Bitcoin Ambassador\" and positioning him as a leading voice in the field of blockchain technology.",
                        "His contributions extended beyond his documentary; he organised the popular \"Bitcoinomics\" Talk Show, which drew in tens of thousands of attendees. This event significantly accelerated the worldwide growth of blockchain technology. His involvement in multiple pioneering projects also amplified his influence and impact on the blockchain world.",
                        "With a record-breaking investment portfolio, Willson is a grandmaster-grade investor sought after by Summit Forums worldwide. He is noted to be the only investor to date to have shared the same stage with legendary Wall Street figure Jim Rogers during a finance and technology event held in Macau in 2014.",
                        "Willsons 's pursuit of excellence has been recognised with many prestigious awards including The BrandLaureate Award for Technology in 2017 and 2019, recognition as one of China's Most Influential Individuals with an interview by the CCTV Network in 2018, the Tech Icon Award in 2019, and the Outstanding Global Chinese Award in 2019. These accolades are just a glimpse of the numerous recognitions he has received, underscoring his esteemed status as one of the trailblazers in the business and technology arena.",
                        "As the Founding President of the World Blockchain Foundation and the Senior Advisor of the Blockchain Regulatory Sandbox in Shenzen, Willson continues to provide invaluable insights and guidance to shape the future of blockchain technology. Since October 2020, he has also served as the Founder and Chief Architect at ProppyApp, a visionary venture aimed at bridging the gap between state-of-the-art future technology and the present times.",
                        "Lee Willson is a man of the future, at the forefront of cutting-edge technologies, determined to bring the public along on this transformative journey. His vision, leadership, and significant contributions to the world of business and technology have marked him as a true and widely recognised innovative visionary, the man from the future."
                    ]
                },
                {
                    "name": "SEAN YAP",
                    "title": "CO-FOUNDER | CHIEF OPERATING OFFICER",
                    "image": "assets/images/team/sean.png",
                    "credentials": "BEng (Electrical & Electronics) 1st Class Hons\n– University of Sussex, UK\nMBA (Management of Technology & e-Business)\n– Cass Business School, London, UK\nChairperson, MDRT Malaysia (2021-2022)",
                    "history": [
                        "Sean Yap, the Co-Founder and Chief Operating Officer of ProppyApp®, has forged a distinguished 28-year career marked by his steadfast commitment to excellence in the engineering, automation, financial, and property technology sectors.",
                        "Throughout his professional journey, Sean has held critical positions at both local and prestigious multinational corporations, including ABB Malaysia and SIEMENS Energy Management & Information Systems (Pte.) Ltd. in Singapore. During his tenure at these esteemed organisations, Sean spearheaded projects exceeding RM200 million, showcasing his proficiency in delivering effective solutions to complex challenges.",
                        "At ABB, Sean played a vital role in power automation with SCADA (Supervisory Control and Data Acquisition) system. SCADA system is essential for monitoring and controlling electrical power grids, providing real-time data and enabling efficient management of electrical networks. Sean was an instrumental team member in developing and implementing the first one-and-a-half breaker system, the first of its kind in Malaysia in the late 1990s.",
                        "This groundbreaking system was designed to ensure high reliability and operational efficiency in power distribution networks by minimising the impact of faults and maintenance activities, thereby ensuring a consistent and reliable power supply. Additionally, he facilitated the transfer of cutting-edge technology from Europe to Malaysia, ensuring local teams were equipped with the latest advancements, highlighting Sean's technical expertise and innovative approach.",
                        "Following his significant stint at ABB, Sean expanded his expertise during a valuable period at Citigroup in London. This strategic role allowed him to refine his skills and gain crucial insights into the financial sector before moving on to Siemens Energy Management & Information Systems.",
                        "At Siemens, Sean's leadership as the department head of the Communication Solutions Department was integral in providing communication solutions tailored to the evolving needs of the Asia Pacific power industry.",
                        "In 2013, after his time at Siemens, Sean transitioned to the financial planning industry, where he thrived for another decade, demonstrating his adaptability and versatility in navigating diverse professional environments.",
                        "Sean is a Registered Financial Planner with the Malaysian Financial Planning Council and served as the Country Chair for Malaysia's Million Dollar Round Table (MDRT) Membership Communications Committee from 2021 to 2022. MDRT is internationally known for establishing the benchmark of excellence in the life insurance and financial services industry.",
                        "Sean's academic accomplishments mirror his professional achievements. He holds a first-class honours degree in Electrical and Electronic Engineering from the esteemed University of Sussex, UK. His outstanding performance earned him the prestigious Institution of Electrical Engineers Prize for the best Electronic/Electrical/Computer Science Major award.",
                        "Continuing his academic pursuits, Sean attained an MBA in Strategic Management of Technology & Electronic Business from Cass Business School, City, University of London (now Bayes Business School), in 2003, fully funded by a prestigious Chevening Scholarship awarded by the UK government. These academic accolades underscore Sean's dedication to continuous learning and innovation, positioning him as a mover and shaker of industry trends and advancements to create positive change.",
                        "Through his unique combination of expertise, experience, and commitment to excellence, Sean Yap drives forward-thinking initiatives and transformative solutions, shaping the landscape of ProppyApp with unparalleled influence and ingenuity. A passionate advocate for lifelong learning, Sean is widely recognised for his selfless knowledge-sharing, contributing significantly to the professional growth of his peers and the broader community."
                    ]
                },
                {
                    "name": "WILL FUNG",
                    "title": "CO-FOUNDER | LEGAL ADVISOR",
                    "image": "assets/images/team/will.png",
                    "credentials": "LLB (Hons)\nImmediate Past-Chairman, Malaysian Chamber of Commerce & Industry (China)",
                    "history": [
                        "Will Fung is a highly respected legal professional with over 24 years of expertise across diverse practice areas including corporate M&A, foreign direct investments, corporate & commercial law, banking & finance, and international dispute resolution. Will has been based in Grandall Law Firm's Beijing office since 2007, where he was one of the first batch of Registered Foreign Counsel with the Beijing Justice Bureau, reflecting his deep commitment to and nuanced understanding of the Chinese and international legal landscape.",
                        "Upon his admission to the Malaysian Bar in 2001, Will began his illustrious career as an Associate at Messrs. Shook Lin & Bok in Kuala Lumpur, swiftly progressing to become a Partner at Messrs. Arthur Wang, Lian & Associate within just 3 years in practice. In 2006, Will relocated to Beijing to serve as a Foreign Legal Counsel with Lehman, Lee & Xu, significantly honing his expertise in international legal affairs. He then joined Grandall Law Firm in Beijing in July 2007 as a Senior Foreign Counsel, where his exceptional negotiation skills and robust business acumen distinguished him. His ability to craft customised solutions and demonstrate outstanding legal expertise garnered him widespread recognition in the legal field.",
                        "Throughout his career, Will has played an instrumental role in numerous high-profile corporate restructuring and joint venture projects across various industries, including TMT, Advertising & PR, Pharmaceuticals, Petrochemicals, Oil & Gas, and Impact Funds/Financial Inclusion. Recognised for his contributions to the legal field, Will has received prestigious accolades such as being named a Notable Practitioner in M&A, China by IFLR 1000, Notable Practitioner (2013, 2022, 2021, 2018) and Corporate & M&A, China by The Legal 500 (2021). He is also a prolific author, co-authoring several key publications, including \"The International Comparative Legal Guides (ICLG): Lending & Secured Finance Laws and Regulations China 2024\" (May 2024); \"ICLG: China – Private Equity Laws and Regulations 2021\" (October 2021); \"Global Legal Insights: Mergers & Acquisitions, China Chapter, 8th Edition\", Global Legal Group, UK (June 2019), 7th Edition (June 2018), 6th Edition (April 2017) & 5th Edition (March 2016); Author: \"Policy-Oriented vs. Market-Oriented Bankruptcy: A Tour on the PRC New Enterprise Bankruptcy Law\", Lexis-Nexis China Law (September 2006); China Law Reporter – International Law of the American Bar Association (January 2007 – Volume 3, Issue 1).",
                        "As an esteemed speaker and presenter, Will has shared his expertise at numerous international conferences and seminars, including \"Contracts in China – Practical Issues\", (Chile, November 2010) organised by the Pontificia Universidad Catolica de Chile; \"Doing Business in China: The Nuts and Bolts\", (Kuala Lumpur, October 2009) organised by the Malaysian Bar\", \"Time for some House Keeping – ALB In-House Legal Summit Beijing 2009\", (Beijing, November 2009) organised by Key Media, Asian Legal Business Events; \"China Law Updates – New Enterprise Bankruptcy Law\", (Singapore, February 2007) organised by the Singapore Business Federation; \"IP & Investment Strategy for Asian Market: How to Build Your Success\", (Seoul, October 2006) hosted by the Ministry of Information and Communication, South Korea, in conjunction with Global Law.",
                        "His distinguished clientele includes China Minmetals Corporation (CMC), CRRC (formerly known as China Southern Rolling Stock Corporation), China Guangdong Nuclear Power Group (CGN), China Everbright Group, Inspur Group, Bitmain Group, Alibaba Capital, WeCapital, BONA Entertainment Group, Huntsworth PLC (UK), MayAir Group PLC (UK), PureCircle Limited (UK), Bord na Mona (Ireland), Zebra Technologies Corporation (USA), IVC Corporation (USA), Pitney Bowes (USA), Reed Exhibitions (USA & UK), Freedom Water Corp (Canada), Omnilife (Mexico), Bank Negara Malaysia, Khazanah Nasional Berhad (Malaysia), Malaysia Airlines Berhad (Malaysia), UMW Oil & Gas (Malaysia), Proton Holdings Berhad (Malaysia), Scomi Engineering Berhad (Malaysia), Taliworks Corporation Berhad (Malaysia), Kelington Engineering (Malaysia), LOOB Holding (Malaysia), Huang Yao Foundation (Singapore), Parkson Retail Group (Hong Kong PRC), Grassland Finance (Hong Kong PRC), Opps! Jealous (Taiwan PRC) etc."
                    ]
                }
            ]
        },
        {
            "title": "Key Core Team Members",
            "members": [
                {
                    "name": "JACINTH BOK",
                    "title": "CO-FOUNDER AND CHIEF OF STAFF",
                    "image": "assets/images/team/Jacinth.png",
                    "credentials": "BSc (Hons) in Applied Accounting – Oxford Brookes University, UK",
                    "history": [
                        "Ms Jacinth Bok is a dynamic and accomplished professional with a robust background in finance, accounting and entrepreneurship. She graduated with a BSc (Hons) in Applied Accounting from Oxford Brookes University, UK, and honed her skills as a former auditor with a top 10 audit firm, gaining valuable experience in financial analysis and reporting.",
                        "Building upon her strong foundation in finance, Jacinth embarked on an entrepreneurial journey and achieved extraordinary success in the online business sector. For the past 17 years, she has operated a profitable enterprise selling collectables on eBay. Her business insights and ability to adapt to the evolving digital landscape have been instrumental in her sustained success.",
                        "Jacinth's entrepreneurial drive, coupled with her profound interest in Bitcoin and blockchain technology, propelled her into the field of cryptocurrencies. Recognising her potential, Mr Lee Willson, a renowned Bitcoin ambassador, invited her to join the World Blockchain Foundation (WBF) as one of its founding members. At the WBF, Jacinth leverages her comprehensive understanding of crypto assets and business acumen to provide invaluable administrative and research services on blockchain-related matters. She also conducts workshops and training sessions on Bitcoin and blockchain, empowering individuals with knowledge to navigate and harness the transformative power of these technologies.",
                        "In addition to her contributions to the WBF, Jacinth holds a prominent role as a Co-Founder and Chief of Staff at ProppyApp. Collaborating closely with the CEO's office, she plays a pivotal role in executing strategic planning initiatives and ensuring their successful implementation, propelling the company to new frontiers in the real estate technology industry.",
                        "Jacinth's outstanding combination of academic excellence, professional experience, and entrepreneurial spirit has positioned her as a valuable asset in finance, blockchain, and technology. Her multifaceted career continues to thrive as she significantly impacts and shapes the future of Trust Technology initiatives spearheaded by ProppyApp."
                    ]
                },
                {
                    "name": "SP LAI",
                    "title": "CHIEF PRODUCT OFFICER",
                    "image": "assets/images/team/mrlai.png",
                    "credentials": "Professional Graduate Diploma in IT\nBCS Professional Member (MBCS)",
                    "history": [
                        "Mr Lai Swee Pin or better known as SP Lai is an experienced IT professional who has successfully delivered several ICT projects and large turnkey projects for a diverse client base including the private sector, public sector and government-linked companies. He is also known for his in-depth skills in System and IoT integration.",
                        "Mr Lai has over three decades of experience in initiating and delivering projects across multiple industries, including but not limited to enterprise resource planning (ERP) systems, intelligent transportation systems, smart city solutions, and large-scale solar power plants.",
                        "Mr Lai's core areas of focus are strategy formulation and cross-functional team leadership. In addition to this, he has extensive expertise in project management and team coordination for multi-million-dollar budget projects and coordinating subcontractors and consultants."
                    ]
                }
            ]
        },
        {
            "title": "Corporate Advisory Team",
            "members": [
                {
                    "name": "Y.M. TENGKU DATO DR HISHAMMUDDIN ZAIZI BIN TENGKU AZMAN SHAH",
                    "title": "STRATEGIC ADVISOR",
                    "image": "assets/images/team/advisor-tengku.png",
                    "credentials": "",
                    "history": [
                        "Y. M. Tengku Dato' Dr Hishammuddin Zaizi, a distinguished member of the Selangor Royal Family, is a multifaceted leader whose influence extends across business, social causes, sports development, and international diplomacy. With an honours degree in Political Science from Australia's Flinders University, he has built an impressive career as Director of iKHASAS Group and Chairman of Oriental Kopi Holdings Berhad, where his strategic vision has driven innovation in sectors ranging from logistics to food and beverage.",
                        "As a forward-thinking business leader, Y. M. Tengku Dato' Dr Hishammuddin Zaizi champions sustainable and inclusive growth models. His leadership extends into academia as CEO of the School of Business & Economics at Universiti Putra Malaysia, where he plays a pivotal role in shaping future business leaders. His philosophy of daring to be different while pursuing excellence has become a hallmark of his approach in both corporate and entrepreneurial ventures.",
                        "Beyond the boardroom, Y. M. Tengku Dato' Dr Hishammuddin Zaizi demonstrates deep commitment to humanitarian causes. As Chairman of Pertubuhan Amal THZ, he leads initiatives providing essential aid including food, medical supplies and educational support to underprivileged communities. His dedication to humanitarian work earned him the Gold Medal Honour from the Palestinian President for his contributions in Palestine. He actively promotes inclusivity through various roles including as Patron of Persatuan Komuniti Orang Kurang Upaya Pendengaran Selangor (PKOKUPS), supporting the hearing-impaired community, and as Honorary Advisor for the UN Global Compact Network Malaysia, where he advocates for sustainable business practices.",
                        "Ever a passionate sports enthusiast, Y. M. Tengku Dato' Dr Hishammuddin Zaizi holds leadership positions in several athletic organisations. As President of both the Malaysia Ice Hockey Federation and Selangor Ice Hockey Association, he works to develop winter sports in Malaysia. He also supports other sports as Patron of the Selangor Volleyball Association and Squash Racquets Association of Putrajaya, while his role as Advisor for the Malaysia Scuba Diving Association allows him to promote marine conservation through recreational diving.",
                        "In cultural and diplomatic spheres, he serves as President of Persatuan Melayu Bugis Selangor, preserving Malay-Bugis heritage, and as Patron of the Malaysia-Vietnam Friendship Association, where he strengthens bilateral relations between the two nations. His environmental advocacy is demonstrated through his role as Patron of Ocean Hero Conservation, aligning with UN Sustainable Development Goals to protect marine ecosystems. This commitment to sustainability earned him a platform to speak at UNESCO headquarters in Paris about urgent ecological challenges.",
                        "From corporate boardrooms to community initiatives, Y. M. Tengku Dato' Dr Hishammuddin Zaizi's leadership is defined by passion, integrity, and a relentless drive to make a difference. Whether through business, sports, or philanthropy, he continues to inspire progress – proving that true success lies in uplifting others. \"Leadership is not just about achievement – it's about responsibility, innovation, and leaving a meaningful legacy.\" – A principle that guides his remarkable journey."
                    ]
                },
                {
                    "name": "EVAN NGOW",
                    "title": "CO-FOUNDER AND CORPORATE TRAINING ADVISOR",
                    "image": "assets/images/team/evan.png",
                    "credentials": "MA (Applied Linguistics)\n– Curtin University of Technology, Australia\nBEd (TESL) Hons\n– University Malaya, Malaysia\nDeputy Secretary General, World Blockchain Foundation",
                    "history": [
                        "Evan Ngow, Chief People and Culture Officer at Prince Bank PLC, Cambodia, brings over 26 years of leadership experience in corporate consulting and coaching, with a main focus on corporate organisations, banks, and financial institutions. He is a dynamic developer and leader of people, with a strong focus on strategic interventions to cultivate high-performance cultures within organisations. Evan designs and implements transformative programmes that reshape corporate systems and shape individual mindsets and behaviours.",
                        "As a renowned engagement specialist and catalyst for organisational change, Evan collaborates with corporate leaders to design effective structures and navigate complex transitions. He develops bespoke strategic leadership and team intervention programmes aimed at achieving both individual and corporate strategic objectives. His programmes address motivation, conflict management, emotional intelligence, effective decision-making, culture and diversity, leadership styles, effective communication, succession planning, developing growth mindsets, and performance monitoring.",
                        "To date, Evan has coached and trained various corporate leaders across Southeast Asia, including numerous Government-Linked Companies (GLCs), Top Tier Local Companies (TTLCs), Multinational Corporations (MNCs), and Small and Medium Enterprises (SMEs) in Malaysia, Singapore, and Cambodia.",
                        "In addition to his role as Co-Founder and Corporate Training Advisor at ProppyApp, Evan contributes significantly as a member of the Industry Advisory Panel for the Management and Humanities School at Universiti Teknologi Petronas, a leading technology-based university in the region, and at Universiti Tunku Abdul Rahman. He also serves as the Deputy Secretary-General of the World Blockchain Foundation, where he drives the growth and educational initiatives of blockchain technology in Malaysia and neighbouring regions through diverse courses and outreach programmes."
                    ]
                },
                {
                    "name": "JANICE LEE",
                    "title": "CORPORATE ADVISOR",
                    "image": "assets/images/team/janicelee.png",
                    "credentials": "Graduated from RMIT University, Melbourne, Australia\nA member of the China Institute of Certified Public Accountants (CICPA), Hong Kong Institute of Certified Public Accountants\nAustralia CPA, Malaysia Institute of Accountants",
                    "history": [
                        "Ms Janice Lee has more than 25 years of service experience in finance, internal control and financial management consulting. She has extensive technical knowledge and practical experience in mergers and acquisitions, initial public offerings, financial resource integration in new business acquisitions, PMO for new business initiatives, tax planning, design and execution of internal control/standard operating procedures, investment, treasury and financing.",
                        "Janice is an experienced CFO currently based in Beijing. Previously, she worked as Audit Services Director and PMO/Director of a new business initiative for a global big 4 audit firm in the Beijing office since 2005 when she was sponsored for a global secondment program by the Kuala Lumpur office.",
                        "She has been providing IPO preparation and audit services, design and review of internal control, due diligence and financial management consulting to corporate clients including multinational, Fortune 500, listed clients and local companies in multi-locations in the Asia Pacific region across industries such as property development, trading, construction & engineering, pharmaceutical, equipment manufacturing, hospitals, FMCG and etc."
                    ]
                },
                {
                    "name": "DEXTER KUA",
                    "title": "FINANCIAL SERVICES ADVISOR",
                    "image": "assets/images/team/dexter.png",
                    "credentials": "Former Vice Chairman of the Malaysian Chamber of Commerce and Industry in China (MAYCHAM)\nGeneral Manager of North Region China of SME Standard Chartered Bank China\nChief Operating Officer of Grassland Finances Limited.",
                    "history": [
                        "Mr Dexter Kua brings over 26 years of solid management acumen garnered from foreign banks and microfinance companies, demonstrating a profound understanding of SME loan operations in commercial banks and credit institutions. Since 2021, he has been actively involved in retail digital financing in Southeast Asia, notably in Indonesia and Vietnam.",
                        "In addition to his expertise in conventional financial services, Dexter excels in digital online automated lending, especially in \"Buy Now Pay Later\" financial services for consumer goods and supply chain finance. He has a strong grasp of digital transformation and the overall operation of science and technology projects, successfully transitioning from traditional financial management to Internet fintech entrepreneurship.",
                        "Dexter's strength lies in expanding financing channels through meticulous market analysis and industry research. He effectively combines company characteristics and business realities to establish multiple financing platforms using both traditional and innovative methods, thereby exploring diverse capital sources to bolster group business development.",
                        "Moreover, Dexter has a deep insight into China's financial market, particularly in small and medium enterprises (SMEs) and micro-lending businesses. In 2007, he was hired by Standard Chartered Bank China to lead the SME segment for the entire northern region of China. Under his leadership, the portfolio and team expanded significantly, growing from 15 staff to over 600. Dexter is proficient at identifying and addressing business needs, excelling in product innovation and integration. Additionally, he is skilled in financing channel management, business development, and project promotion.",
                        "From 2017 to 2024, Dexter served as the Vice Chairman of the Malaysian Chamber of Commerce and Industry in China. He now applies his wealth of experience in his roles as Chief Sales Officer and Financial Services Advisor at ProppyApp. His expertise in finance, digital lending, and market dynamics positions him as one of the key contributors to ProppyApp's growth and success."
                    ]
                },
                {
                    "name": "LIM SOON CHENG",
                    "title": "CORPORATE FINANCE ADVISOR",
                    "image": "assets/images/team/SCLim.png",
                    "credentials": "Member of the Malaysian Association of Certified Public Accountants (MICPA)\nMember of the Malaysian Institute of Accountants (MIA)\nMember of the Financial Planning Association of Malaysia – Certified Financial Planner (CFP)",
                    "history": [
                        "Mr Lim Soon Cheng, popularly known as SC Lim, is a distinguished chartered accountant with a diverse portfolio spanning accounting, taxation, secretarial, and business advisory services. With more than 15 years of expertise in lecturing Malaysian professional examinations, specifically in Malaysian taxation papers, he is widely recognised as an expert in his field. In addition, he has a proven track record of delivering insightful seminars and public speaking engagements on taxation-related topics. His comprehensive knowledge and extensive experience have earned him a reputation as a highly respected authority in the industry.",
                        "During his early career, SC Lim achieved remarkable success at two international accounting firms in Penang, where he held prominent positions for 6 years. Notably, he excelled as a branch manager, showcasing exceptional leadership skills and gaining extensive knowledge in accounting, taxation, and business management.",
                        "Building upon this valuable experience, SC Lim embarked on an entrepreneurial path by establishing his own tax consultancy and business advisory companies in Malaysia and Singapore. This bold move allowed him to leverage his expertise and industry insights to provide comprehensive services to clients across various sectors, including plantations, cosmetic manufacturing, flavour products, food, and properties.",
                        "Additionally, SC Lim assumed a senior partner position in a secretarial company, expanding his reach and influence in the business realm. Through his involvement in multiple businesses and industries, he has developed an acumen for their unique challenges and opportunities, enabling him to offer strategic guidance and support tailored to each client's specific needs.",
                        "As a trusted consultant, SC Lim provides strategic advice on corporate matters, compliance, and tax planning to corporations. His expertise includes optimal preparations for tax audits, comprehensive tax planning strategies, and effective compliance measures. In recognition of the importance of tax audits and investigations, he established a dedicated department within his consultancy to handle these assignments, ensuring his clients receive thorough support in navigating complex tax regulations.",
                        "SC Lim's role as an in-house corporate advisor extends to a wide range of companies, including 100% local enterprises, local and foreign joint ventures, and 100% foreign-owned entities, operating across various industries in different countries. His global perspective and business understanding are further demonstrated through his trustee positions for international bodies and nominee directorships in Malaysia and overseas.",
                        "SC Lim has served as the Corporate Finance Advisor in ProppyApp since 2023, where he leverages his extensive knowledge and multifaceted experience to shape and drive the company's financial strategies, ensuring its continued success and growth."
                    ]
                },
                {
                    "name": "LIM SAY LEONG",
                    "title": "STRATEGIC CAPITAL & MARKETS ADVISOR",
                    "image": "assets/images/team/LSL.png",
                    "credentials": "Masters of Business Administration from Edinburgh Business School, Heriot-Watt University, UK\nProfessional Accountancy Qualification from The Chartered Institute of Management Accountants (CIMA), UK\nRegistered Chartered Accountant with the Malaysian Institute of Accountants (MIA)\nAssociate Member of the Chartered Tax Institute of Malaysia (CTIM)",
                    "history": [
                        "Mr Lim Say Leong is a seasoned and accomplished business leader with over three decades of experience in finance, accounting, and strategic management. Bolstered by an impressive track record, he has established himself as a prominent figure in the corporate world, having worked across diverse industries and geographical regions.",
                        "Mr Lim has held several high-profile jobs that demonstrate his leadership and commercial ability. He successfully managed Denko Industrial Corporation Berhad, a Bursa Malaysia main board-listed company, and its many subsidiaries in manufacturing and services as Group CEO and Group Executive Director.",
                        "As Group CEO of Yen Global Berhad, Mr Lim developed and implemented strategic initiatives to boost performance and meet stakeholder goals. He co-founded Everise Concepts PLT, a successful firm that provides corporate and business consultation and real estate projects. The company thrived under his inventive leadership.",
                        "In addition to his executive roles, Mr Lim has made significant contributions as an Independent Director of Aurora Italia International Berhad. and as the Chairman of the Audit Committee at LFE Corporation Berhad. He has held positions as an Independent Director and Chairman of the Nomination Committee, as well as a member of the Risks Management and Audit Committee, at Caely Holdings Berhad, solidifying his reputation as a trusted advisor and advocate for corporate governance.",
                        "Mr Lim possesses expertise in a wide range of areas, including initial public offerings (IPOs), special purpose acquisition companies (SPACs), mergers and acquisitions (M&A), restructuring, rightsizing, funding strategies, training, and operational controls. His extensive experience spans markets in Malaysia, the United States, Singapore, Indonesia, Hong Kong, China, and Australia.",
                        "Currently, he serves as the Executive Chairman and CEO of Globalink Investment Inc., a publicly listed company on NASDAQ New York. He has also been welcomed and He joined ProppyApp in 2023 as Capital Venture Advisor.",
                        "With his exceptional leadership abilities, extensive industry knowledge, and proven track record, Lim Say Leong continues to make significant contributions to the business landscape and serves as an inspiration to aspiring leaders.",
                        "Beyond his professional achievements, Mr Lim finds solace in literature and enjoys exploring the great outdoors during his leisure time."
                    ]
                },
                {
                    "name": "WAN FARA AYU W AHMAD",
                    "title": "VENTURE CAPITAL ADVISOR",
                    "image": "assets/images/team/WAN-FARA-AYU-W-AHMAD.png",
                    "credentials": "BBA (Hons) Finance – Universiti Tenaga Nasional\nServed as Registered Responsible Person for Venture Capital Fund Management with the Securities Commission, Malaysia (2019 – 2023)\nVenture Capital Fund Manager\nAsia CEO Club Member (2022-2023) & ASEAN CEO Club (Member)",
                    "history": [
                        "Wan Fara Ayu W. Ahmad is a distinguished professional with over two decades of specialised experience in the venture capital and entrepreneurship landscape. She is renowned for her expertise in high-level networking, identifying potential unicorns, and making high-growth venture capital investments. Her pivotal role in nurturing startups globally has left an indelible mark on the industry.",
                        "Her notable undertakings are defined by her founding roles in Alpha One Ventures and Delphinium.io, demonstrating her entrepreneurial spirit and leadership in the industry. Fara is a registered professional with Malaysia's Securities Commission, she maintains a steadfast commitment to ethical and sustainable finance practices. This commitment was further highlighted when she was recently invited to speak on 'Sustainable and Responsible Investment Funds' at Malaysia's Audit Committee Conference in 2023.",
                        "Wan Fara's concerted efforts in implementing global expansion strategies have resulted in establishing working relationships across the world. She is currently serving as the Country Trustee for The Bridge International (Korean-based) and previously served as a WBAF Senator and Country Chair for Malaysia under a G20 affiliate known as the World Business Angel Forum (\"WBAF\"), which included the participation of ambassadors, senators, and high commissioners from 133 countries, signifying her global influence.",
                        "She also served as a Board Member of the Global Start-up Committee at WBAF, one of the main committees overseeing global start-ups' participation in the WBAF World Congress. Furthermore, her role as an Expert Board Judge at the Unicorn World Cup & Silicon Valley's Network VC allowed her to have direct access to proprietary deal flows and an invaluable network of investors and experts.",
                        "Wan Fara's contributions are tangible through her overseeing 11 fund companies with a total asset under management (AUM) of RM350 million, significantly supporting the growth of SMEs and startups. She actively engages in industry-defining initiatives such as Alibaba Create Cloud, Huawei Strategic Partnership, Fly Asia X KOICA Innoport, HGU, Unitwin & UNESCO-organised events on Smart Cities, and Bridge International, among others.",
                        "Her dedication to driving impactful and sustainable ventures is evident through all her initiatives, supporting the UNSDGs but especially through Alpha One Ventures, which champions SDG-17, Partnership for the Goals, and has established over 20 global partnership agreements with ecosystem players worldwide. Wan Fara has also advocated for Artificial Intelligence (AI) through numerous engagements with industry thought leaders and digital asset enthusiasts. She has ventured into real estate investments, participated in business development missions, and collaborated with stakeholders across the globe.",
                        "As part of her passion project, Wan Fara also hosts \"The Crypto Genius Show,\" delving into cutting-edge topics including NFTs, the Metaverse, AI, and blockchain, featuring prominent voices in these fields. In 2022, NFT.NYC selected her to host a satellite event and invited her to speak in 2023 for 'NFT for Good'. Additionally, Wan Fara partnered with a renowned NYC investment fund manager to run the Global Trailblazers Podcast, where she interviews international VC fund managers, Bloomberg, and serial entrepreneurs alike. One of her present and main endeavours also includes indulging in international commodities trading with much passion and fervour.",
                        "Wan Fara's expertise and passion align seamlessly with ProppyApp's mission to revolutionise the property industry using state-of-the-art technologies. Her visionary guidance is an asset to our journey."
                    ]
                },
                {
                    "name": "PETER LAM",
                    "title": "STRATEGIC ADVISOR",
                    "image": "assets/images/team/Peter-Lam.png",
                    "credentials": "B.A. in Business Administration, National University of Singapore\nT. Harv Eker certified Master Trainer\nCertified Business Coach by ActionCOACH",
                    "history": [
                        "Mr Peter Lam commands a formidable presence in the corporate world, leveraging over two decades of unparalleled expertise and leadership. Armed with a B.A. in Business Administration from the prestigious National University of Singapore, his professional trajectory is nothing short of extraordinary.",
                        "In his corporate career spanning 22 years, Peter has held crucial positions in General Management within leading multinational corporations and Fortune 100 companies such as Unilever, Kraft Foods (now Kraft-Heinz), and Ogilvy & Mather. His extensive expertise covers a spectrum of areas, including successful business growth strategies, effective leadership, team motivation, marketing prowess, brand building, nuanced communication, negotiation skills, and overseeing product development from inception to market success.",
                        "In 2003, Peter's career took a transformative turn as he transitioned into Business and Executive Coaching, marking the beginning of a remarkable journey. His stellar success includes winning the Action Man Award in 2006 and the prestigious Platinum-level coaching award in 2007, establishing him as the first Platinum Coach in Malaysia.",
                        "These accolades and recognitions underscore his groundbreaking coaching approach, guiding business leaders and teams to seamlessly apply their learnings effectively in practical scenarios. Renowned for his 20,000-foot perspective, Peter excels in identifying areas that wield the most significant impact. Over his coaching years, he has successfully shaken up the status quo, transformed behaviours, and achieved unprecedented results for dozens of leaders and their teams.",
                        "As a T. Harv Eker certified Master Trainer, Peter offers signature programs like Strategic Planning Retreat, ProfitMAX Masterclass, Virtuous Leadership, Total Team Alignment, Streetwise Marketing, and The 7 Habits of Sales Champions.",
                        "Beyond his coaching prowess, Peter is celebrated as a dynamic high-impact presenter, keynote speaker, and moderator at numerous business conferences. His ability to challenge conventions and achieve unprecedented results has solidified his standing within the industry.",
                        "In 2018, Peter authored the highly acclaimed and award-winning book, \"ProfitMAX Your Business,\" providing invaluable insights into sustainable revenue growth, enhanced profitability, and the cultivation of high-performing teams.",
                        "Peter's thought leadership extends to contributions in publications such as Focus Malaysia, Entrepreneur Insight, and Leaderonomics, showcasing his influential presence in the business community. His insights have been prominently featured in media outlets, including The Star and BFM Radio.",
                        "In May 2021, Peter founded ProfitMAX Entrepreneurs Network (PEN), a community characterised by quality collaboration among like-minded entrepreneurs and professionals. With a discerning approach, PEN currently boasts around 100 esteemed members.",
                        "Peter Lam's journey exemplifies his dedication to assisting corporations and business leaders in navigating and succeeding in the ever-evolving business landscape. As a strategic architect and seasoned professional, he plays a pivotal role in aligning organisations with industry best practices, infusing a mature professional style into their endeavours. His wealth of experience and strategic vision make him an invaluable asset, driving towards innovation and sustained success. The impact of his work is not just felt; it's transformative."
                    ]
                },
                {
                    "name": "ROBEST YONG",
                    "title": "INNOVATIVE ADVISOR",
                    "image": "assets/images/team/Robest-Yong.png",
                    "credentials": "Innovative Advisor, ProppyApp Sdn Bhd\nAdjunct Professor, DRB-HICOM University\nFounder, Prodigious Innovations Sdn Bhd\nFounder and CEO, Innopreneur Enterprise",
                    "history": [
                        "Robest Yong's career is a powerful testament to the transformative potential of innovation. From his early days as a \"Garage Inventor\" to being named Innovation Ambassador by Agency Innovation Malaysia (AIM) in 2010, Robest's journey reflects a deep commitment to groundbreaking ideas, driven by his belief in \"Thinking Without the Box.\"",
                        "In the early 1990s, Robest transitioned from engineering to entrepreneurship, founding Prodigious Innovations Sdn Bhd. His notable inventions—such as the Polyclone Instant Rubber Stamp, KAMIKAZE Mosquito Attractant Glue, and VisionTouch Braille Phone—earned him both national and global recognition, including the Malaysian National Inventor of the Year, a Gold Medal at the International Inventions Competition in Geneva, and the Outstanding Young Malaysian Award.",
                        "Robest has played a pivotal role in shaping Malaysia's innovation landscape. He has contributed to transformative initiatives like the PEMANDU NKEA Transformations Lab and MiGHT OECD IP System Study, influencing the direction of the country's innovation efforts.",
                        "In addition to his inventions, Robest is dedicated to fostering the next generation of innovators. As an Adjunct Professor at DRB-HICOM University, he uses his vast experience to mentor students, shaping the future of Malaysia's innovation sector. This new academic role highlights his ongoing contribution to the development of future leaders in the field.",
                        "A regular speaker at TEDxKL, TEDxINTI, and the National Entrepreneurship Innovation Forum, Robest also served as a panelist at the National Entrepreneurship Innovation Forum (NEIF), organised by the Institute of Tunku Abdul Rahman University Management and Technology. His participation focused on bridging the gap between academia and industry to foster innovation.",
                        "Robest also dedicates time to mentoring and judging innovation competitions, such as the SME Bank Sandbox Swiss Innovation Challenge 2024. His consulting roles with organisations like Yayasan Inovasi Malaysia, Cradle Malaysia Funds, and GRAB Innovation School have further cemented his status as a key figure in Malaysia's innovation scene.",
                        "Robest is also passionate about social responsibility. In November 2024, he led an expedition to Kampung OA Selweng, Gerik, Perak, where he distributed 65 Efinity Water Filters to local villagers ahead of the monsoon season, demonstrating his dedication to improving the lives of underserved communities.",
                        "Currently serving as an Innovative Advisor for ProppyApp, Robest continues to influence the company's growth, fostering a culture of innovation that mirrors his own career."
                    ]
                },
                {
                    "name": "SIM JOH KHUANG",
                    "title": "INTERNAL CONTROL ADVISOR",
                    "image": "assets/images/team/JK-Sim.png",
                    "credentials": "Association of Chartered Certified Accountants (ACCA)\nFellow Member, Association of Chartered Certified Accountants\nChartered Accountant, Malaysian Institute of Accountants",
                    "history": [
                        "Mr Sim Joh Khuang has more than 25 years of expertise in accounting and finance, including more than 17 years in China where he served clients from a diverse range of industries.",
                        "Over the years, he has provided statutory audit services for companies engaged in manufacturing, trading, construction, hospitality, property development, plantation, power generation, shipping and investment holding. Apart from special audits for Chinese subsidiaries of American companies (both listed and non-listed), Joh Khuang has conducted financial due diligence, business valuations, and special audits for merger and acquisition activities.",
                        "Bolstered by his extensive experience in internal audit and reviewing internal controls, Joh Khuang is also well-equipped to assist clients in meeting their compliance and governance requirements. In addition, he is responsible for assisting clients with fraud investigations, forensic accounting, and litigation assistance, as well as assisting clients with the review of their operations in an effort to increase efficiency and reduce expenses.",
                        "Joh Khuang has worked at a Big 4 firm in Malaysia and China, and another two foreign accounting and consulting firms headquartered in Beijing and Shanghai, respectively. In 1997, he was admitted to the Association of Chartered Certified Accountants (ACCA) and became a Fellow (FCCA) in 2004. He has also been a member of the Malaysian Institute of Accountants since 1999."
                    ]
                },
                {
                    "name": "ROBERTO CAPODIECI",
                    "title": "TECHNICAL ARCHITECT ADVISOR",
                    "image": "assets/images/team/Roberto.png",
                    "credentials": "IBM Mainframe Administrator- Istituto Meccanografico Veneto, Padua, Italy",
                    "history": [
                        "Mr Roberto Capodieci is a luminary Chief Technology Officer (CTO) with a stellar three-decade track record in the IT industry. His distinguished merits and achievements have earned him a reputation as a visionary who excels in transforming challenging business initiatives into innovative and sustainable technology solutions. He is renowned for designing custom blockchain platforms and spearheading complex system integrations, achieving groundbreaking designs and industry firsts.",
                        "Over the course of his illustrious profession, Roberto has amassed an impressive list of achievements that have left an indelible mark on the industry. As the Chief Executive Officer of Blockchain Zoo, his technical leadership empowered experts to build decentralised systems while solidifying the company's presence in Southeast Asia. As the Chief Technology Officer of Digital Billions, he spearheaded the design of integrated customer networks using blockchain technology, securing comprehensive bids for groundbreaking blockchain projects.",
                        "Beyond his professional accomplishments, Roberto is a prolific author and captivating podcast speaker. He has penned books like \"ZooBC: New Strategies in Blockchain\" and \"Snapshot NXT – Unsurpassable Blockchain Solutions\" and more. Through his podcasts, he fascinates his audiences with insights on Metaverse, carbon credits, the future of blockchain, and all things technology. His fluency in multiple languages, including English, Indonesian, French, and Italian, further broadens his reach and impact on the global tech community.",
                        "Currently, Roberto serves as the CTO at SimFly in Singapore, trailblazing the development of a revolutionary Play-to-Earn platform for a Metaverse game. His supreme technical expertise and hands-on coding prowess ensure the delivery of a high-quality, secure, and infinitely scalable application.",
                        "Roberto Capodieci's journey is a testament to his steadfast dedication to game-changing technological invention, continually inspiring and redefining the frontiers of technology. With exceptional expertise in blockchain, dynamic leadership, and a penchant for exploring cutting-edge solutions, he remains a true vanguard in the IT industry. Recognising his unparalleled talent, ProppyApp has appointed him as our Technical Architect since July 2023."
                    ]
                },
                {
                    "name": "DR RONALD TEE",
                    "title": "TECH & AI ADVISOR",
                    "image": "assets/images/team/ronald.png",
                    "credentials": "PhD in Wireless Communication Engineering\nMSc in Electrical Engineering\nBEng (1st Class Hons) in Electrical & Electronic Engineering",
                    "history": [
                        "Dr Ronald Tee has more than 20 years of work experience in data analytics, research, engineering and consulting. He managed and led various projects and functions covering data analytics, financial crime risk analytics, forensic investigation and litigation technology in Europe.",
                        "He established strategic analytics functions to support multiple business partners and has demonstrated his vision and leadership in the analytics space to influence critical business decisions.",
                        "Over the years, he has held different leadership positions at global corporations, consulting firms and financial institutions. He has worked and lived in various countries, including Malaysia, Singapore, Switzerland, the United Kingdom, Poland and Denmark.",
                        "During his academic research, he has published more than 15 papers in well-known conferences and journals, as well as a book with Wiley & Sons. He is also a full scholarship recipient of JPA, ASEAN and the British Overseas Research Scholarship.",
                        "Having worked and embraced in global teams in his career, his aspiration is to promote diversity with different cultural backgrounds to drive organisational and company success."
                    ]
                },
                {
                    "name": "ZIHAN TAN",
                    "title": "PATRON PROJECT C360",
                    "image": "assets/images/team/zihan.png",
                    "credentials": "",
                    "history": [
                        "Ms Zihan Tan is an exemplary individual who displays dedication and compassion as a Patron of Project C360. Her selfless commitment to community service has had a profound impact on the lives of those in need.",
                        "Zihan's journey as a volunteer began in 2021 when she actively participated in disaster relief efforts in Taman Sri Muda. She enthusiastically fundraised and coordinated the transportation of essential materials to support the affected community.",
                        "In 2022, Zihan completed the 11th Love Agent training program conducted by Life Line Association Malaysia. This experience further ignited her passion for public service, leading her to engage in various initiatives such as cleaning nursing homes and participating in environmental protection activities.",
                        "In July 2022, Zihan joined Community360 as a community scout. In this role, she played a vital part in planning and organising charitable activities. These included the Peka B40 health and blood test campaign, NADMA initiatives, and health awareness campaigns with iM Booster, while also visiting and contributing food donations to PPR, blood donation drives, old folk homes, persons with disabilities, and events for anak yatim.",
                        "As a Patron of Project C360, Zihan continues to devote her time, skills, and resources to uplift communities and make a lasting impact. Her kindness, generosity, and genuine concern for others serve as an inspiration to those around her and contribute to the betterment of society.",
                        "When not actively volunteering, Zihan works as an Accounts Manager in a building materials company in Malaysia. With over 15 years of experience, she oversees the financial and account management of the parent company and subsidiaries. In addition to her financial responsibilities, she has also held positions in Sales and Marketing management in various companies."
                    ]
                },
                {
                    "name": "ANNGELA PANG",
                    "title": "PATRON PROJECT C360",
                    "image": "assets/images/team/Anngela.png",
                    "credentials": "",
                    "history": [
                        "Ms Anngela Pang is an esteemed member of our advisory team at Project C360, bringing over ten years of expertise in the curtains industry. Her professional journey spans multiple sectors, including eight successful years as a beautician in Singapore and Australia.",
                        "In 2018, Anngela ventured into Stem Cell research and has actively remained involved. She showcased exceptional leadership abilities in 2019 when she led a team of 100 individuals for a Singaporean company, overseeing an antique auction on behalf of Rothschild in Malaysia. That same year, she joined a renowned property agency as a property agent, demonstrating her adaptability.",
                        "Anngela's passion for helping others knows no bounds. For over a decade, she has been a committed MAA Insurance and Takaful consultant, providing invaluable guidance to her clients. In 2019, she further expanded her skill set with specialised training in Trade Finance & Private Placement Programs at Relius International Bank in Bangkok.",
                        "Her commitment to making a positive impact on society is evident through active involvement in charitable initiatives since 2015. Anngela has supported various organisations, including the United World Chinese Association, SMK ST Gabriel, and S.P.K. Pertuturan KIU. Since 2020, she has participated in the ProppyApp charity initiative, engaging in events such as Peka B40 Health Screening, NADMA, and Health Awareness Campaign by iM Booster, while also visiting and contributing food donations to PPR, blood donation drives, old folk homes, persons with disabilities, and events for anak yatim.",
                        "Anngela Pang's wide-ranging background, extensive experience, and unwavering dedication make her an invaluable asset to our advisory team. Her professional acumen and commitment to philanthropy align perfectly with our mission to deliver exceptional services and create a positive impact on society."
                    ]
                }
            ]
        }
    ]
}