{
  "testimonials": [
    {
      "id": 1,
      "name": "Chong Yeaw Kiong",
      "title": "Managing Partner",
      "company": "Messrs. J.A. Nathan & Co., Advocates & Solicitors",
      "quote": "ProppyApp's innovative approach to Property Technology, leveraging cutting-edge technologies like big data and AI, is a game-changer. The platform's commitment to transparency and efficiency aligns seamlessly with the evolving needs of the industry. ProppyApp is a transformative force, driving positive change and fostering trust within the technology community.",
      "bio": "Chong Yeaw Kiong is an accomplished legal professional with an LL.B. (Hons) from the University of Malaya. Serving as Managing Partner at Messrs. J.A. Nathan & Co., Advocates & Solicitors, he brings strategic leadership to the firm.<br><br>Beyond legal practice, he is an Independent Non-Executive Director at Seng Fong Holdings Bhd. (PLC), and actively contributes to community roles, including as Member of the Board of Governors at SJK (C) Pu Nan - Bukit Bakri.<br><br>Chong Yeaw Kiong is known for his diverse portfolio and unwavering commitment to excellence.",
      "image": "../assets/images/testimonials/Chong Yeaw Keong.jpg"
    },
    {
      "id": 2,
      "name": "Thomson Tan",
      "title": "Founder",
      "company": "Natty Team",
      "quote": "As a premium merchant on ProppyApp, I have successfully digitalized my business and used the platform's tools to increase my business exposure. I am proud to support other merchants in their digital transformation within this dynamic ecosystem. Being part of ProppyApp's C360 team also allows me to connect those in need with support, reflecting our shared values of community and compassion. Despite a busy schedule, I remain passionate about contributing to these initiatives and helping create an innovative and supportive environment for everyone.",
      "bio": "Thomson Tan is a seasoned professional with nearly three decades of experience in the playground and manufacturing sectors. Starting his career as a sales executive in 1995, he steadily advanced to become a senior sales manager, demonstrating his dedication and exceptional sales expertise.<br><br>In 2005, he founded Natty Team, which has since gained international recognition for excellence in plastic component manufacturing for playgrounds and OEM services.<br><br>Under Thomson's visionary leadership, Natty Team has established itself as a leading supplier in Malaysia, renowned for its commitment to quality and innovation. His strategic vision and dedication earned him a feature in the 2020 publication Successful People in Malaysia, where he shared invaluable insights from his entrepreneurial journey.<br><br>As a dynamic and influential entrepreneur, Thomson continues to drive business growth, forge strategic partnerships, and shape the future of the playground and manufacturing industries with unwavering dedication and excellence.",
      "image": "../assets/images/testimonials/Thomson Tan.jpg"
    },
    {
      "id": 3,
      "name": "IR. TS Ong",
      "title": "Professional Engineer",
      "company": "Multi-discipline Engineering Expert",
      "quote": "ProppyApp consistently pushes boundaries, leaving a significant impact on the property technology industry, neighbourhood economy, and individuals. I am genuinely impressed by the high level of expertise and commitment demonstrated by the company. ProppyApp's dedication to sustainability and social responsibility is truly inspiring.",
      "bio": "IR. TS Ong is a dynamic professional known for his expertise in technical fields, especially in project management, procurement, and corporate operations. With a diverse skill set that includes commercial acumen, process optimisation, and strategic operational planning, he contributes effectively to various corporate organisational functions regionally and globally.<br><br>Recognised for his results-driven approach, he consistently delivers operational excellence, fosters growth, optimises profitability, and achieves impactful results.<br><br>His certifications as a Lean Six Sigma expert and credentials as a Professional Engineer in the electronic discipline, ASEAN Chartered Professional Engineer, International Professional Engineer, and APEC Engineer Registered in Instrumentation and Control, underscore his technical prowess.<br><br>Ong excels in project management within multinational contexts, seamlessly integrating technical expertise with effective communication and negotiation skills. His commitment to excellence extends to customer-focused support and services, specialising in various technical areas.<br><br>Outside his professional endeavours, Ong actively engages in volunteer work, particularly contributing to education and environmental initiatives.",
      "image": "../assets/images/testimonials/IR. TS Ong.jpg"
    },
    {
      "id": 4,
      "name": "TC Siah",
      "title": "Managing Director",
      "company": "Top Quarter (M) Sdn. Bhd.",
      "quote": "ProppyApp is reshaping the real estate landscape by leveraging cutting-edge technology to bridge gaps. This strategic use of technology signifies a transformative shift, ushering in a new era of connectivity, efficiency, and innovation within the industry.",
      "bio": "TC Siah, a Marketing Management graduate from the University of Baltimore, has crafted a distinguished career. He completed the Senior Executive Program at Tsinghua University and participated in the International Training Program on Collaborative and Innovative Management in the Elderly Care Industry.<br><br>As the Managing Director of Top Quarter (M) Sdn. Bhd., he oversees a diverse portfolio, including All Avenue Resources Sdn. Bhd., Equal Harmony Development Sdn. Bhd., Maming Development (Ayer Keroh) Sdn. Bhd., and Taureo Sdn. Bhd.<br><br>With over three decades in real estate development, Mr. Siah guides his companies through investments, emphasising sustainability. He is actively involved in ecotourism projects in Pahang, Malaysia.<br><br>Beyond his corporate role, he holds key positions in influential organisations, contributing to the business community and broader society.",
      "image": "../assets/images/testimonials/TC Siah.jpg"
    },
    {
      "id": 5,
      "name": "Low Han Beng",
      "title": "Community Leader",
      "company": "Bengoo Marketing PLT",
      "quote": "In the digital age, ProppyApp integrates big data, artificial intelligence, and the Internet of Things to build an intelligent, secure, and efficient digital ecosystem. He believes we aren't just advancing in competition; we're forging a new path, a path for the future.",
      "bio": "Low Han Beng from Bengoo Marketing PLT has dedicated more than 35 years to social organisations and he's been involved in every aspect of the community as a leader with hands-on experience in community operations, event planning, and management.<br><br>He was one of the first to personally engage with and deeply utilise ProppyApp - Org360, the one-stop community management system. He discovered that this isn't just a tool; it's a crucial key to driving the digital transformation of social organisations.<br><br>It truly makes organisations smarter, more efficient, and more secure, empowering every social organisation leader to strategise and control the overall situation.<br><br>He firmly believes that in this AI-powered era, social organisations should also keep pace with the times and achieve sustainable operations through technological empowerment!",
      "image": "../assets/images/testimonials/Low Han Beng.jpg"
    },
    {
      "id": 6,
      "name": "Anngela Pang",
      "title": "Founder",
      "company": "Ever Best Enterprise",
      "quote": "Partnering with ProppyApp makes running my business easier and more efficient! I've always wanted to find an online platform that truly supports small and medium-sized businesses like us, and ProppyApp not only provides us with a display space for our products but also allows us to see genuine customer feedback through the Review & Rating system, significantly strengthening trust. Vouchers and Promoter Codes help us flexibly launch promotions to attract new customers and reward existing ones. The convenient sharing feature of QR Codes allows offline customers to access our online store with ease. All of these tools are designed to be easy to use, allowing us to focus on our products and services instead of navigating technical operations.",
      "bio": "Anngela Pang, founder of Ever Best Enterprise, has been custom-making curtains, roller blinds, wooden blinds, carpets, and wallpaper for over a decade.",
      "image": "../assets/images/testimonials/ANNGELA PANG.png"
    },
    {
      "id": 7,
      "name": "Fan Ruey Yin",
      "title": "CEO",
      "company": "EA MSc Sdn Bhd",
      "quote": "Prop360 helps me buy, rent, and sell properties that truly fit my investment goals and lifestyle needs, all within one convenient and user-friendly platform. It saves me valuable time and offers clear, data-driven insights that support smarter and more confident property buying decisions.",
      "bio": "Fan Ruey Yin, CEO of EA MSc Sdn Bhd, a company that provides comprehensive security solutions for multinational corporations in Penang and Kuala Lumpur.",
      "image": "../assets/images/testimonials/Fan Ruey Yin.jpg"
    },
    {
      "id": 8,
      "name": "Lsr Mok Kam Loong",
      "title": "Managing Director",
      "company": "Jurukur Warisan Sdn Bhd",
      "quote": "Using Market360 and SignaTrue has transformed how I run my business, bringing total control, clarity, and efficiency. Digitalising my work helps me spend more time looking at data and much less time looking for it. Market360 simplifies e-commerce by connecting me directly with customers and payments, making selling more personal and profitable. SignaTrue streamlines document control, letting me securely review, sign, and archive everything in the cloud. Together, they deliver the performance and precision every modern business needs.",
      "bio": "Lsr Mok Kam Loong is the Managing Director of Jurukur Warisan Sdn Bhd, a licensed land surveying firm.<br><br>He also serves as an Independent Non-Executive Director of LTKM Bhd and previously held the position of Treasurer at Koperasi Jurukur Tanah Berlesen Berhad for eight years.",
      "image": "../assets/images/testimonials/Lsr Mok Kam Loong.jpg"
    },
    {
      "id": 9,
      "name": "Kim Poh",
      "title": "Marketing Consultant",
      "company": "Brand Strategy Expert",
      "quote": "ProppyApp's innovation in trust-building technology is outstanding. By combining big data and intelligent systems, it has built a trust- and transparency-driven ecosystem that connects communities, property management, and service providers. With Homes360, Market360, and Org360, ProppyApp creates a complete, traceable digital cycle that redefines how people live, work, and build trust in modern communities.",
      "bio": "Kim Poh is a seasoned marketing consultant with extensive experience in brand strategy and team development, specialises in building creative and high-performing marketing teams, upgrading brand visual identity, and integrating cross-product strategies to enhance overall brand efficiency.",
      "image": "../assets/images/testimonials/Kim.jpg"
    },
    {
      "id": 10,
      "name": "Datuk Loo Chee Wee",
      "title": "Property Group Leader",
      "company": "Sin Hee Yang Property Group",
      "quote": "ProppyApp is an outstanding super app that unites the entire property supply chain and related services. I believe it will continue to grow and make a positive impact on both society and the property industry.",
      "bio": "Datuk Loo Chee Wee is a respected leader in the property industry with Sin Hee Yang Property Group.",
      "image": "../assets/images/testimonials/Datuk Loo Chee Wee.jpg"
    },
    {
      "id": 11,
      "name": "Er Yuk Bee",
      "title": "Director",
      "company": "Aplus Software Sdn Bhd",
      "quote": "I joined ProppyApp as a Merchant in 2021, when it first introduced the 'Neighbourhood Economy' concept that empowers inclusive digital economies. The evolution into Market360 has been transformative, expanding beyond property into a digital commerce ecosystem. My clients now place orders effortlessly, with transparent pricing and instant transactions that save time and boost sales. Market360 has eliminated manual quotations and streamlined operations, making it far easier to close deals. It's a game-changer for my business.",
      "bio": "Er Yuk Bee is the Director of Aplus Software Sdn Bhd, a well-established Malaysian company specialising in business management software designed to help small and medium-sized enterprises streamline their accounting, payroll, and operations for over 30 years. With a strong focus on e-invoicing and digital transformation, she is committed to enabling businesses to improve efficiency and maintain compliance through innovative technology solutions.",
      "image": "../assets/images/testimonials/Er Yuk Bee.jpg"
    },
    {
      "id": 12,
      "name": "Lee Kok Heng",
      "title": "Director & Founder",
      "company": "Proto Interior (M) Holding Sdn Bhd",
      "quote": "With 18 years in the interior fit-out industry, we have experienced many business ups and downs, especially during the pandemic in 2020. In 2021, I was introduced to ProppyApp, and I quickly saw its potential to help businesses like ours go digital. The platform offers powerful tools such as product promotion, customer ratings, endorsements, and digital vouchers, all in one place. ProppyApp continues to innovate with solutions that meet government requirements, including e-invoicing, payment gateways, and accounting integration. It has truly simplified how we manage and grow our business. We are thankful to ProppyApp for creating such an amazing platform that helped us stay resilient and connected through challenging times.",
      "bio": "Lee Kok Heng is the Director & Founder of Proto Interior (M) Holding Sdn Bhd, with 18 years of experience in the interior fit-out industry.",
      "image": "../assets/images/testimonials/Lee Kok Heng.jpg"
    }
  ]
}